In [1]:
# Import pandas package
import pandas as pd
# Assign data
data = {'Name': ['Usha', 'Nikhitha', 'Ria', 'Asha', 'Nisha', 'Roja'],
		'Age': [20, 21, 22, 23, 24, 25],
		'Gender': ['F', 'F', 'F', 'F', 'F', 'F'],
		'Marks': [100, 95, 70, 'NaN', 50, 80]}

# Convert into DataFrame
df = pd.DataFrame(data)

# Display data
df

       Name  Age Gender Marks
0      Usha   20      F   100
1  Nikhitha   21      F    95
2       Ria   22      F    70
3      Asha   23      F   NaN
4     Nisha   24      F    50
5      Roja   25      F    80

In [2]:
# Compute average
c = average = 0
for ele in df['Marks']:
	if str(ele).isnumeric():
		c += 1
		average += ele
average /= c

# Replace missing values
df = df.replace(to_replace="NaN",
				value=average)
df

       Name  Age Gender  Marks
0      Usha   20      F  100.0
1  Nikhitha   21      F   95.0
2       Ria   22      F   70.0
3      Asha   23      F   79.0
4     Nisha   24      F   50.0
5      Roja   25      F   80.0

In [5]:
# import module
import pandas as pd

# creating DataFrame for Student Details
details = pd.DataFrame({
	'id': [1051, 1077, 1450, 1023, 1045, 1056],
	'Name': ['Usha', 'Nikhitha', 'Ria', 'Asha', 'Nisha', 'Roja'],
	'Branch': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE',
			'CSE']})
print(details)

     id      Name Branch
0  1051      Usha    CSE
1  1077  Nikhitha    CSE
2  1450       Ria    CSE
3  1023      Asha    CSE
4  1045     Nisha    CSE
5  1056      Roja    CSE

In [6]:
# Import module
import pandas as pd

# Creating Dataframe for Fees_Status
fees_status = pd.DataFrame(
	{'id': [1051, 1077, 1450, 1023, 1045, 1056],
	'pending_fee': [2345, 76243, 24324, 'Nil', 7325, 33243]})

print(fees_status)

     id pending_fee
0  1051        2345
1  1077       76243
2  1450       24324
3  1023         Nil
4  1045        7325
5  1056       33243

In [8]:
# Import module
import pandas as pd

# Creating Dataframe
details = pd.DataFrame({
	'id': [1051, 1077, 1450, 1023, 1045, 1056],
	'Name': ['Usha', 'Nikhitha', 'Ria', 'Asha', 'Nisha', 'Roja'],
	'Branch': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE','CSE']})

fees_status = pd.DataFrame(
	{'id': [1051, 1077, 1450, 1023, 1045, 1056],
	'pending_fee': [2345, 76243, 24324, 'Nil', 7325, 33243]})

# Merging Dataframe
print(pd.merge(details, fees_status, on='id'))

     id      Name Branch pending_fee
0  1051      Usha    CSE        2345
1  1077  Nikhitha    CSE       76243
2  1450       Ria    CSE       24324
3  1023      Asha    CSE         Nil
4  1045     Nisha    CSE        7325
5  1056      Roja    CSE       33243

In [10]:
# Import module
import pandas as pd

# Creating Data
car_selling_data = {'Brand': ['Mercedes', 'BMW', 'jaguar','SUV'],
					'Year': [2018, 2017, 2014, 2015],
					'Sold': [1, 3, 5, 7]}

# Creating Dataframe of car_selling_data
df = pd.DataFrame(car_selling_data)
print(df)

      Brand  Year  Sold
0  Mercedes  2018     1
1       BMW  2017     3
2    jaguar  2014     5
3       SUV  2015     7

In [9]:
# Import module
import pandas as pd

# Creating Data
car_selling_data = {'Brand': ['Mercedes', 'BMW', 'jaguar','SUV'],
					'Year': [2018, 2017, 2014, 2015],
					'Sold': [1, 3, 5, 7]}

# Creating Dataframe for Provided Data
df = pd.DataFrame(car_selling_data)

# Group the data when year = 2010
grouped = df.groupby('Year')
print(grouped.get_group(2018))

      Brand  Year  Sold
0  Mercedes  2018     1

In [11]:
# Import module
import pandas as pd

# Initializing Data
student_data = {'Name':  ['Usha', 'Nikhitha', 'Ria', 'Asha', 'Nisha', 'Roja'],

				'Roll_no': [1051, 1077, 1450, 1023, 1045, 1056],

				'Email': ['usha@gmail.com', 'nikhithage@gmail.com',
						'rias@gmail.com', 'asha@gmail.com',
						'nishax@gmail.com', 'roja@gmail.com']}

df = pd.DataFrame(student_data)
print(df)

       Name  Roll_no                 Email
0      Usha     1051        usha@gmail.com
1  Nikhitha     1077  nikhithage@gmail.com
2       Ria     1450        rias@gmail.com
3      Asha     1023        asha@gmail.com
4     Nisha     1045      nishax@gmail.com
5      Roja     1056        roja@gmail.com

In [12]:
# import module
import pandas as pd

# initializing Data
student_data = {'Name':  ['Usha', 'Nikhitha', 'Ria', 'Asha', 'Nisha', 'Roja'],

				'Roll_no': [1051, 1077, 1450, 1023, 1045, 1056],

				'Email': ['usha@gmail.com', 'nikhithage@gmail.com',
						'rias@gmail.com', 'asha@gmail.com',
						'nishax@gmail.com', 'roja@gmail.com']}

df = pd.DataFrame(student_data)

# Here df.duplicated() list duplicate Entries in ROllno.
# So that ~(NOT) is placed in order to get non duplicate values.
non_duplicate = df[~df.duplicated('Roll_no')]

print(non_duplicate)

       Name  Roll_no                 Email
0      Usha     1051        usha@gmail.com
1  Nikhitha     1077  nikhithage@gmail.com
2       Ria     1450        rias@gmail.com
3      Asha     1023        asha@gmail.com
4     Nisha     1045      nishax@gmail.com
5      Roja     1056        roja@gmail.com